tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "supabase/tap"
brew "autojump"
brew "cocoapods"
brew "fnm"
brew "fzf"
brew "htop"
brew "starship"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "supabase/tap/supabase"
cask "cool-retro-term"
cask "flameshot"
cask "font-anonymice-nerd-font"
cask "font-fira-code"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "raycast"
cask "sloth"
cask "spotify"
cask "stats"
vscode "adamvoss.vscode-languagetool"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "ChakrounAnas.turbo-console-log"
vscode "Continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "DjProphet.everforest-custom"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fosshaas.fontsize-shortcuts"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "Gruntfuggly.todo-tree"
vscode "jackjyq.brogrammer-plus"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "metaseed.MetaJump"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "Nixon.env-cmd-file-syntax"
vscode "rangav.vscode-thunder-client"
vscode "SonarSource.sonarlint-vscode"
vscode "steoates.autoimport"
vscode "SteveSevetS.doom-emacs-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "TabNine.tabnine-vscode"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wesbos.theme-cobalt2"
vscode "will-stone.plastic"
vscode "withfig.fig"
