tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "supabase/tap"
brew "sqlite"
brew "autojump"
brew "bat"
brew "bfg"
brew "btop"
brew "clifm"
brew "ruby"
brew "cocoapods"
brew "difftastic"
brew "diskonaut"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "git"
brew "gnu-typist"
brew "helix"
brew "htop"
brew "jq"
brew "lazygit"
brew "neovim"
brew "nginx"
brew "pkgconf"
brew "pnpm"
brew "qpdf"
brew "rbenv"
brew "ripgrep"
brew "starship"
brew "the_silver_searcher"
brew "wireguard-tools"
brew "yarn"
brew "yazi"
brew "zellij"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "supabase/tap/supabase"
cask "alt-tab"
cask "around"
cask "bluesnooze"
cask "cool-retro-term"
cask "cursor"
cask "dbngin"
cask "elmedia-player"
cask "flameshot"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-ubuntu-mono-nerd-font"
cask "font-zed-mono-nerd-font"
cask "hyperkey"
cask "keycastr"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "notunes"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "shortcat"
cask "sloth"
cask "spotify"
cask "stats"
cask "sublime-text"
cask "syntax-highlight"
cask "telegram-desktop"
cask "transmission"
cask "visual-studio-code"
cask "wezterm"
cask "zen-browser"
vscode "42crunch.vscode-openapi"
vscode "adamvoss.vscode-languagetool"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "codeium.codeium"
vscode "dbaeumer.vscode-eslint"
vscode "djprophet.everforest-custom"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fosshaas.fontsize-shortcuts"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "gruntfuggly.todo-tree"
vscode "jackjyq.brogrammer-plus"
vscode "jdinhlife.gruvbox"
vscode "johnpapa.winteriscoming"
vscode "juniorschmidt.lunar-vscode-theme"
vscode "kamikillerto.vscode-colorize"
vscode "lmn451.git-log-s"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "metaseed.metago"
vscode "metaseed.metajump"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "mvllow.rose-pine"
vscode "nixon.env-cmd-file-syntax"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "sdras.night-owl"
vscode "smelukov.vscode-csstree"
vscode "sonarsource.sonarlint-vscode"
vscode "steoates.autoimport"
vscode "stevesevets.doom-emacs-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "teabyii.ayu"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wesbos.theme-cobalt2"
vscode "will-stone.plastic"
vscode "yinfei.luahelper"
