tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "supabase/tap"
brew "autojump"
brew "cocoapods"
brew "eza"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "git"
brew "htop"
brew "lazygit"
brew "neovim"
brew "pnpm"
brew "starship"
brew "wireguard-tools"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "supabase/tap/supabase"
cask "cool-retro-term"
cask "elmedia-player"
cask "flameshot"
cask "font-anonymice-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "keycastr"
cask "raycast"
cask "rectangle"
cask "sloth"
cask "spotify"
cask "stats"
cask "syntax-highlight"
cask "visual-studio-code"
vscode "adamvoss.vscode-languagetool"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "ChakrounAnas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "degreat.fonted"
vscode "DjProphet.everforest-custom"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fosshaas.fontsize-shortcuts"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "Gruntfuggly.todo-tree"
vscode "jackjyq.brogrammer-plus"
vscode "johnpapa.winteriscoming"
vscode "JuniorSchmidt.lunar-vscode-theme"
vscode "lmn451.git-log-s"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "mvllow.rose-pine"
vscode "Nixon.env-cmd-file-syntax"
vscode "PKief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "sdras.night-owl"
vscode "SonarSource.sonarlint-vscode"
vscode "steoates.autoimport"
vscode "SteveSevetS.doom-emacs-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "teabyii.ayu"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wesbos.theme-cobalt2"
vscode "will-stone.plastic"
